###
Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и вывести на печать.
###

    my_spis = ["s", "p", "i", "s", "o", "k"]
    my_str = "".join(my_spis)
    print(my_str[::-1])
